fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.ВКМ_СтатусЗаявкиНаОбслуживание</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполняемыеРаботы</name>
    <attributes>
      <name>ПредоставляемаяУслуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonForms/ВКМ_КалендарьСпециалистов/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода,КонецПериода);
	Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;  
    Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Истина; 

	ОбновитьПланировщик();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиентов" Тогда
		ОбновитьПланировщик();
	КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Специалист = ЗначенияИзмерений.Получить("Специалист");
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Начало);
	ЗначенияЗаполнения.Вставить("Специалист", Специалист);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПланировщик()
	
	Планировщик.Элементы.Очистить();
	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить();
	
	ИзмерениеСпециалист = ИзмеренияПланировщика.Добавить("Специалист");
 	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист.Представление КАК СпециалистПредставление
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот >= &НачалоГода
		|	И ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот <= &КонецГода
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот >= &НачалоГода
		|	И ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот <= &КонецГода";
	
	Запрос.УстановитьПараметр("КонецГода", КонецГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ТекущаяДатаСеанса()));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаСпециалист = МассивРезультатов[0].Выбрать();
	ВыборкаРаботы = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаСпециалист.Следующий() Цикл
		НовыйСотрудник = ИзмерениеСпециалист.Элементы.Добавить(ВыборкаСпециалист.Специалист);  
	    НовыйСотрудник.Текст = ВыборкаСпециалист.Специалист;
	КонецЦикла;
	
	Пока ВыборкаРаботы.Следующий() Цикл
		ВремяНачалаРабот = ВыборкаРаботы.ДатаПроведенияРабот + (ВыборкаРаботы.ВремяНачалаРабот - Дата(1,1,1));
		ВремяОкончанияРабот = ВыборкаРаботы.ДатаПроведенияРабот + (ВыборкаРаботы.ВремяОкончанияРабот- Дата(1,1,1));
		
	    СоответствиеЗначений = Новый Соответствие;
        СоответствиеЗначений.Вставить("Специалист",   ВыборкаРаботы.Специалист);
        
		ЭлементПланировщика = Планировщик.Элементы.Добавить(ВремяНачалаРабот, ВремяОкончанияРабот);
		ЭлементПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначений);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
